FKDD_COPY_DIFF_3_2026-02-13/ExchangePlans/ОбменССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ОбменССайтом</Name>
			<Comment>План обмена реализующий интеграцию конфигурации с сайтом</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПлательщика</Name>
					<Comment>Вид плательщика, используемый при обмене заказами</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦенКонтрагентаДляВыборкиТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКартинки</Name>
					<Comment>Признак выгрузки картинок номенклатуры на сайт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Comment>Признак выгрузки на сайт, в противном случае в каталог</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТоварыБезЦены</Name>
					<Comment>Признак выгрузки номенклатуры без цены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТолькоИзменения</Name>
					<Comment>Признак выгрузки изменений данных, в противном случае признак выгрузки всех данных</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовыхКонтрагентов</Name>
					<Comment>Элемент родитель создаваемых контрагентов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьДокументыТекущейДатой</Name>
					<Comment>Признак записи документа текущей датой, в противном случае используется дата загружаемого документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентныеЗадания</Name>
					<Comment>Признак использования регламентных заданий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогОбменаHTTP</Name>
					<Comment>Файловый путь к каталогу куда будут выгружаться файлы необходимые при обмене</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляВыборкиТоваров</Name>
					<Comment>Контрагент для отбора товаров</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Comment>Автор документа ЗаказПокупателя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗаказами</Name>
					<Comment>Признак выгрузки\загрузки заказов покупателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменТоварами</Name>
					<Comment>Признак выгрузки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, которая подставляется в соответствующий реквизит документа ЗаказПокупателя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольHTTP</Name>
					<Comment>Пароль учетной записи, под которой происходит обмен данными</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПроксиHTTP</Name>
					<Comment>Пароль учетной записи http прокси</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение, которое подставляется в создаваемый заказ покупателя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляВыборкиТоваров</Name>
					<Comment>Подразделение для определения цен товаров</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортHTTP</Name>
					<Comment>Порт web сервера</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПроксиHTTP</Name>
					<Comment>Порт http прокси, через который осуществляется доступ к web серверу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательHTTP</Name>
					<Comment>Учетная запись на сайте, под которой производится обмен данными</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательПроксиHTTP</Name>
					<Comment>Имя учетной записи http прокси</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Comment>Признак проведения загружаемых документов в противном случае документы только записываются</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументыОперативно</Name>
					<Comment>Признак оперативного проведения создаваемых документов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Comment>Регламентное задание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПроксиHTTP</Name>
					<Comment>URL адрес скрипта, доступ к которому осуществляется через http прокси</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверHTTP</Name>
					<Comment>URL адрес скрипта, производящего обмен со стороны сайта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройкиПостроителя</Name>
					<Comment>Настройки отбора построителя отчета, который используется при отборе выгружаемой номенклатуры</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИдентификацииКонтрагентов</Name>
					<Comment>Признак идентификации контрагентов либо по ИНН, либо по наименованию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Comment>ип цены, который подставляется в соответствующий реквизит документа ЗаказПокупателя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредставленияВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/ExchangePlans/ОбменССайтом/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;			// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ТекущееРегламентноеЗадание Экспорт; // Текущее регламентное задание

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция возвращает объект регламентного задания
Функция ПолучитьОбъектРегламентногоЗадания() Экспорт
		
	ТекущееРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(РегламентноеЗадание);
	Возврат ТекущееРегламентноеЗадание;
			
КонецФункции

// Найти регламентное задание по параметру
Функция НайтиРеглЗаданиеПоПараметру(УникальныйНомерЗадания)
	
	Попытка		
		Если ( НЕ ПустаяСтрока(УникальныйНомерЗадания) ) Тогда		
			УникальныйИдентификаторЗадания = Новый УникальныйИдентификатор(УникальныйНомерЗадания);
			ТекущееРегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторЗадания);	
		Иначе		
			ТекущееРегламентноеЗадание = Неопределено;	
		КонецЕсли;
		
	Исключение	
		ТекущееРегламентноеЗадание = Неопределено;	
    КонецПопытки;
	
	Возврат ТекущееРегламентноеЗадание;
	
КонецФункции

// Процедура устанавливает значение переменных регламентного задания
Процедура УстановитьЗначенияПеременныхРегламентныхНастроек() Экспорт
	
	Если (ТекущееРегламентноеЗадание = Неопределено) Тогда
		ТекущееРегламентноеЗадание = ПолучитьОбъектРегламентногоЗадания();			
	КонецЕсли;	
		
КонецПроцедуры

// Процедура устанавливает параметры регламентного задания
Процедура УстановитьПараметрыРегламентногоЗадания(РеквизитЗадания, ПараметрЗадания, КлючРегламентногоЗадания, Постфикс = "")
	
	Если ( ПараметрЗадания = Неопределено ) Тогда
		РеквизитЗадания = "";
	Иначе		
		РеквизитЗадания					= Строка(ПараметрЗадания.УникальныйИдентификатор);
		ПараметрЗадания.Наименование	= Наименование + Постфикс;
		
		// генерируем уникальный ключ, что бы в один момент времени 2 регламентных задания не выполнялись
		Если ( ПустаяСтрока(ПараметрЗадания.Ключ)) Тогда
			ПараметрЗадания.Ключ = КлючРегламентногоЗадания;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("КодНастройки", Код);
		Массив = Новый Массив();
		Массив.Добавить(СтруктураПараметров);
		
		ПараметрЗадания.Параметры.Очистить();
		ПараметрЗадания.Параметры = Массив;
		ПараметрЗадания.Записать();	
					
	КонецЕсли;	
	
КонецПроцедуры

// Процедура установить режим регламентных задач
Процедура УстановитьРежимРегламентныхЗадач() Экспорт
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если (ТекущееРегламентноеЗадание = Неопределено) Тогда
		Возврат;	
	КонецЕсли;
	
	Если (ТекущееРегламентноеЗадание.Использование = Истина) Тогда	
		Возврат;		
	КонецЕсли;
	
	ТекущееРегламентноеЗадание.Использование = Ложь;	
	ТекущееРегламентноеЗадание.Записать();
		
КонецПроцедуры

// Функция производит поиск регламентного задания по настройке
Функция НайтиРегламентноеЗаданиеПоНастройке() Экспорт
	
	ТекРегламентноеЗадание = НайтиРеглЗаданиеПоПараметру(РегламентноеЗадание);	
	Возврат ТекРегламентноеЗадание;
	
КонецФункции

// Процедура заполняет настройки значениями по умолчанию
Процедура ЗаполнитьНастройкуОбменаWEBЗначениямиПоУмолчанию(НастройкаОбмена) Экспорт
	
	НастройкаОбмена.ВыгружатьТолькоИзменения		= Истина;
	НастройкаОбмена.ВыгружатьНаСайт		 			= Истина;
	
	НастройкаОбмена.Организация = ПараметрыСеанса.Организация;
	Если (обЗначениеНеЗаполнено(НастройкаОбмена.Организация)) Тогда 
		Выборка = Справочники.Организации.Выбрать();
		Если (Выборка.Следующий()) Тогда
			НастройкаОбмена.Организация = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	НастройкаОбмена.Подразделение					= ПараметрыСеанса.ПодразделениеКомпании;
	НастройкаОбмена.Менеджер						= ПараметрыСеанса.Пользователь;
	НастройкаОбмена.СпособИдентификацииКонтрагентов	= "Наименование";
	НастройкаОбмена.ТипЦены							= обПраво("ОсновнойТипЦенПродажи");
	КаталогОбменаHTTP								= КаталогВременныхФайлов();
	
КонецПроцедуры

// Проверка заполнения
Функция ПроверитьКорректность(ЭтаФорма) Экспорт
	Отказать	= Ложь;
	Для Каждого ЭУ Из ЭтаФорма.ЭлементыФормы Цикл
		Если ТипЗнч(ЭУ)=Тип("ПолеВвода") И ЭУ.АвтоотметкаНезаполненного И обЗначениеНеЗаполнено(ЭУ.Значение) Тогда
			Сообщить("Не заполнен обязательный реквизит "+ЭУ.Имя, СтатусСообщения.Важное);
			Отказать	= Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ВидЦенКонтрагентаДляВыборкиТоваров=3 И обЗначениеНеЗаполнено(КонтрагентДляВыборкиТоваров) Тогда
		Сообщить("Не заполнен контрагент для определения цены товара.");
		Отказать	= Истина;
	КонецЕсли;
	
	Возврат Отказать;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик копирования
Процедура ПриКопировании(ОбъектКопирования)
	ТекущееРегламентноеЗадание	= Неопределено;
	РегламентноеЗадание			= "";
КонецПроцедуры

// обработчик перед записью формы
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ( ВыгружатьНаСайт ) Тогда	
		Если обЗначениеНеЗаполнено(СерверHTTP) ИЛИ обЗначениеНеЗаполнено(Наименование)
			ИЛИ обЗначениеНеЗаполнено(Код) ИЛИ обЗначениеНеЗаполнено(ПортHTTP) 
			ИЛИ обЗначениеНеЗаполнено(ПользовательHTTP) ИЛИ обЗначениеНеЗаполнено(ПарольHTTP)
			ИЛИ обЗначениеНеЗаполнено(Подразделение) ИЛИ обЗначениеНеЗаполнено(Организация)
			ИЛИ обЗначениеНеЗаполнено(Менеджер) ИЛИ обЗначениеНеЗаполнено(ТипЦены) Тогда
			#Если Клиент Тогда
			Сообщить("Не заполнены обязательные реквизиты объекта!");
			#КонецЕсли
			Отказ	= Истина;
		ИначеЕсли обЗначениеНеЗаполнено(СпособИдентификацииКонтрагентов) Тогда
			#Если Клиент Тогда
			Сообщить("Не заполнены обязательные реквизиты объекта: Способ идентификации контрагентов");
			#КонецЕсли
			Отказ	= Истина;			
		КонецЕсли;	
	Иначе		
		Если (обЗначениеНеЗаполнено(КаталогОбменаHTTP)) Тогда
			Сообщить("Не указан каталог для обмена данными!");
			Отказ	= Истина;
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	
	Если ( ПометкаУдаления ИЛИ НЕ ИспользоватьРегламентныеЗадания) Тогда
		
		Если (ТекущееРегламентноеЗадание <> Неопределено ) Тогда
			ТекущееРегламентноеЗадание.Использование = Ложь;			
		КонецЕсли;		
					
	Иначе
		
		// если оба выключены регл задания - то включаем основное регл задание
		Если (ТекущееРегламентноеЗадание = Неопределено) Тогда	
			Сообщить("Не выбрано регламентное задание для настройки обмена.");		
		КонецЕсли;			
				
		Если (ТекущееРегламентноеЗадание <> Неопределено) Тогда	
			ТекущееРегламентноеЗадание.Использование = Истина;				
		КонецЕсли;
			
	КонецЕсли;
	
	Если (Отказ) Тогда Возврат; КонецЕсли;
	
	Если (ТекущееРегламентноеЗадание <> Неопределено 
		И НЕ ПустаяСтрока(ТекущееРегламентноеЗадание.Ключ)) Тогда
		
		КлючРегламентногоЗадания = ТекущееРегламентноеЗадание.Ключ;		
	Иначе	
		КлючРегламентногоЗадания = Строка(Новый УникальныйИдентификатор);		
	КонецЕсли;
	
	УстановитьПараметрыРегламентногоЗадания(РегламентноеЗадание, ТекущееРегламентноеЗадание, КлючРегламентногоЗадания);
	
КонецПроцедуры

// Обработчик перед удалением
Процедура ПередУдалением(Отказ)
	УстановитьЗначенияПеременныхРегламентныхНастроек();
	Если (ТекущееРегламентноеЗадание <> Неопределено) Тогда
		ТекущееРегламентноеЗадание.Удалить();
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
